USE master;
GO
/*建立空的MyPetShop数据库*/
/*请根据实际环境更改数据库文件和日志文件的存放路径*/
CREATE DATABASE Studentdata
ON 
( NAME = Studentdata,
    FILENAME = 'D:\Project\VS-project\Solution1\WebSite1\App_Data\Studentdata.mdf',/*...\App_Data\Studentdata.mdf*/
    SIZE = 5MB,
    MAXSIZE = 50MB,
    FILEGROWTH = 1MB )
LOG ON
( NAME = Studentdata_log,
    FILENAME = 'D:\Project\VS-project\Solution1\WebSite1\App_Data\Studentdata_log.ldf',/* ...\App_Data\Studentdata_log.ldf*/
    SIZE = 3MB,
    MAXSIZE = 25MB,
    FILEGROWTH = 1MB )
		COLLATE Chinese_PRC_CI_AS;
GO
USE Studentdata

CREATE TABLE Studentsmath(
    学号 INT PRIMARY KEY,
    姓名 VARCHAR(50),
    专业 VARCHAR(10),
    性别 VARCHAR(10) CHECK(性别 IN ('男', '女')),
    年龄 INT,
    出生日期 DATE,
    家庭住址 VARCHAR(100),
    高等数学 int,
    线性代数 int,
    概率论 int,
    总成绩 int
);


INSERT INTO Studentsmath (学号, 姓名, 专业, 性别, 年龄, 出生日期, 家庭住址,高等数学,线性代数,概率论,总成绩)
VALUES ('10001', '张三', '数学', '男', 20, '2003-05-12', '北京市朝阳区', 85, 78, 90, 253),
       ('10002', '李四', '数学', '男', 19, '2004-02-28', '北京市海淀区', 92, 85, 88, 265),
       ('10003', '王五', '数学', '男', 21, '2002-09-08', '北京市东城区', 78, 91, 85, 254),
       ('10004', '赵六', '数学', '男', 18, '2005-12-01', '北京市西城区', 89, 80, 87, 256),
       ('10005', '钱七', '数学', '女', 20, '2003-07-22', '北京市丰台区', 86, 89, 92, 267),
       ('10006', '孙八', '数学', '女', 19, '2004-04-15', '北京市石景山区', 91, 88, 82, 261),
       ('10007', '周九', '数学', '女', 21, '2002-10-21', '北京市通州区', 80, 78, 89, 247),
       ('10008', '吴十', '数学', '女', 18, '2005-11-11', '北京市昌平区', 88, 92, 90, 270),
       ('10009', '郑十一', '数学', '男', 20, '2003-03-17', '北京市房山区', 85, 86, 83, 254),
       ('10010', '王十二', '数学', '男', 19, '2004-01-02', '北京市大兴区', 92, 90, 85, 267),
       ('10011', '孙十三', '数学', '男', 21, '2002-08-13', '北京市顺义区', 78, 89, 90, 257),
       ('10012', '李十四', '数学', '男', 18, '2005-10-28', '北京市怀柔区', 89, 92, 86, 267),
       ('10013', '赵十五', '数学', '女', 20, '2003-06-04', '北京市密云区', 86, 85, 89, 260),
       ('10014', '钱十六', '数学', '女', 19, '2004-03-01', '北京市延庆区', 91, 78, 92, 261),
       ('10015', '周十七', '数学', '女', 21, '2002-11-18', '北京市平谷区', 80, 91, 83, 254),
       ('10016', '吴十八', '数学', '女', 18, '2005-12-30', '北京市门头沟区', 88, 80, 88, 256);

CREATE TABLE Studentscomputer(
    学号 INT PRIMARY KEY,
    姓名 VARCHAR(50),
    专业 VARCHAR(10),
    性别 VARCHAR(10) CHECK(性别 IN ('男', '女')),
    年龄 INT,
    出生日期 DATE,
    家庭住址 VARCHAR(100),
    数据结构 int,
    操作系统 int,
    计算机网络 int,
    计算机组成原理 int,
    总成绩 int
);
INSERT INTO Studentscomputer (学号, 姓名, 专业, 性别, 年龄, 出生日期, 家庭住址,数据结构,操作系统,计算机网络,计算机组成原理,总成绩)VALUES
('20001', '张十九', '计算机', '男', 22, '2001-02-03', '北京市海淀区', 85, 80, 90, 75, 330),
('20002', '李二十', '计算机', '女', 20, '2003-05-10', '北京市朝阳区', 75, 90, 85, 80, 330),
('20003', '王二一', '计算机', '男', 21, '2002-03-22', '北京市东城区', 80, 70, 95, 85, 330),
('20004', '赵二二', '计算机', '女', 23, '2000-12-31', '北京市西城区', 90, 75, 75, 90, 330),
('20005', '周二三', '计算机', '男', 21, '2002-09-18', '北京市昌平区', 75, 85, 80, 90, 330),
('20006', '钱二四', '计算机', '女', 20, '2003-08-08', '北京市丰台区', 80, 80, 75, 95, 330),
('20007', '孙二五', '计算机', '男', 22, '2001-06-02', '北京市通州区', 75, 90, 85, 80, 330),
('20008', '刘二六', '计算机', '女', 23, '2000-10-11', '北京市顺义区', 70, 85, 90, 85, 330),
('20009', '陈二七', '计算机', '男', 20, '2003-01-28', '北京市房山区', 85, 75, 90, 80, 330),
('20010', '林二八', '计算机', '女', 22, '2001-08-06', '北京市大兴区', 90, 85, 75, 80, 330),
('20011', '黄二九', '计算机', '男', 21, '2002-07-16', '北京市石景山区', 80, 90, 85, 75, 330),
('20012', '吴三十', '计算机', '女', 23, '2000-06-08', '北京市密云区', 75, 80, 95, 80, 330),
('20013', '郑三一', '计算机', '男', 20, '2003-03-29', '北京市怀柔区', 85, 75, 90, 80, 330),
('20014', '王三二', '计算机', '女', 22, '2001-04-25', '北京市门头沟区', 90, 85, 75, 80, 330),
('20015', '赵三三', '计算机', '男', 23, '2000-11-19', '北京市密云区', 75, 90, 80, 85, 330),
('20016', '张三四', '计算机', '女', 20, '2003-01-12', '北京市房山区', 80, 80, 85, 85, 330),
('20017', '李三五', '计算机', '男', 22, '2001-09-09', '北京市门头沟区', 75, 90, 80, 85, 330),
('20018', '王三六', '计算机', '女', 21, '2002-08-15', '北京市密云区', 85, 75, 90, 80, 330);

CREATE TABLE Mmtuser(
    ID INT PRIMARY KEY,
    Username NCHAR (10),
    Password NCHAR (10),
);
INSERT INTO Mmtuser(ID,Username,Password)VALUES
(01,'admin1','12345'),
(02,'admin2','22222'),
(03,'admin3','54321');
